load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000/api
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/notes"
            headers:
              Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2NTk2NTNlMzQ1MGEzNjllNzdjZDAxNWQiLCJpYXQiOjE3MDQzNzA1NTUsImV4cCI6MTcwNDM3NDE1NX0.dgConXmK6bwhM4v58pwAwXimVJkcn9wULTGGvOJHCz8'
        - post:
            url: "/notes"
            json:
              title: '{{ random.words(3) }}'
              content: '{{ random.sentence(5) }}'
            headers:
              Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2NTk2NTNlMzQ1MGEzNjllNzdjZDAxNWQiLCJpYXQiOjE3MDQzNzA1NTUsImV4cCI6MTcwNDM3NDE1NX0.dgConXmK6bwhM4v58pwAwXimVJkcn9wULTGGvOJHCz8'
        count: 100